RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer4_pwm.c
        enRet = Ok;
        /* Get pointer of current channel PWM register address */
        pstcRCSR_f = (__IO stc_tmr4_rcsr_field_t*)TMR4_RCSRx(TMR4x);
        switch (enCh)
        {
            case Timer4PwmU:
                pstcRCSR_f->RTICU = (uint16_t)1u;
                break;
            case Timer4PwmV:
                pstcRCSR_f->RTICV = (uint16_t)1u;
                break;
            case Timer4PwmW:
                pstcRCSR_f->RTICW = (uint16_t)1u;
                break;
            default:
                enRet = ErrorInvalidParameter;
                break;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Write timer count cycle
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of PWM
 ** \arg Timer4PwmOuhl                  Timer4 PWM couple channel OUH&OUL
 ** \arg Timer4PwmOvhl                  Timer4 PWM couple channel OVH&OVL
 ** \arg Timer4PwmOwhl                  Timer4 PWM couple channel OWH&OWL
 ** \param [in] u16PDAR                 PDAR value
 ** \arg  0~65535
 ** \param [in] u16PDBR                 PDBR value
 ** \arg  0~65535
 **
 ** \retval Ok                          Timer count cycle is written
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_PWM_WriteDeadRegionValue(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_pwm_ch_t enCh,
                                uint16_t u16PDAR,
                                uint16_t u16PDBR)
{
    __IO uint16_t *pu16PDAR = NULL;
    __IO uint16_t *pu16PDBR = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_PWM_CH(enCh));

        /* Get pointer of current channel PWM register address */
        pu16PDAR = (__IO uint16_t *)TMR4_PDARx(TMR4x, enCh);
        pu16PDBR = (__IO uint16_t *)TMR4_PDBRx(TMR4x, enCh);

        /* set the register */
        *pu16PDAR = u16PDAR;
        *pu16PDBR = u16PDBR;

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Read dead region count value
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of PWM
 ** \arg Timer4PwmOuhl                  Timer4 PWM couple channel OUH&OUL
 ** \arg Timer4PwmOvhl                  Timer4 PWM couple channel OVH&OVL
 ** \arg Timer4PwmOwhl                  Timer4 PWM couple channel OWH&OWL
 ** \param [out] u16PDAR                Pointer of uint16_t type
 ** \arg  0~65535
 ** \param [out] u16PDBR                Pointer of uint16_t type
 ** \arg  0~65535
 **
 ** \retval Ok                          Read successfully.
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_PWM_ReadDeadRegionValue(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_pwm_ch_t enCh,
                                uint16_t *u16PDAR,
                                uint16_t *u16PDBR)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_PWM_CH(enCh));

        /* Get pointer of current channel PWM register address */
        *u16PDAR = *(__IO uint16_t *)TMR4_PDARx(TMR4x, enCh);
        *u16PDBR = *(__IO uint16_t *)TMR4_PDBRx(TMR4x, enCh);

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set cycle of PWM timer
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of PWM
 ** \arg Timer4PwmOuhl                  Timer4 PWM couple channel OUH&OUL
 ** \arg Timer4PwmOvhl                  Timer4 PWM couple channel OVH&OVL
 ** \arg Timer4PwmOwhl                  Timer4 PWM couple channel OWH&OWL
 ** \param [in]  u16Count               PWM pulse counter value
 ** \arg   0~65535
 **
 ** \retval Ok                          Cycle of PWM timer is set
 ** \retval ErrorInvalidParameter       TMR4x is invalid
 **
 ******************************************************************************/
en_result_t TIMER4_PWM_SetFilterCountValue(M4_TMR4_TypeDef *TMR4x,
                                en_timer4_pwm_ch_t enCh,
                                uint16_t u16Count)
{
    __IO uint16_t *pu16PFSR = NULL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_PWM_CH(enCh));

        /* Get pointer of current channel PWM register address */
        pu16PFSR = (__IO uint16_t*)TMR4_PFSRx(TMR4x, enCh);
        *pu16PFSR =u16Count;

        enRet = Ok;
    }

    return enRet;
}

//@} // Timer4PwmGroup

#endif /* DDL_TIMER4_PWM_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
